Учет_кабельной_продукции/src/Documents/ЗаданияНаЗакупку/ЗаданияНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданияНаЗакупку</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЗаданияНаЗакупкиСтатусы</registerRecords>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.СтатусыЗаданийНаЗакупку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>ЖурналУчетаКП</name>
      <type>
        <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>Принято</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_кабельной_продукции/src/InformationRegisters/ЗаданияНаЗакупкиПринятыеКабельныеЛинии/ЗаданияНаЗакупкиПринятыеКабельныеЛинии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияНаЗакупкиПринятыеКабельныеЛинии</name>
  <dimensions>
    <name>КабельняЛиния</name>
    <type>
      <types>CatalogRef.КабельныеЛинии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_кабельной_продукции/src/InformationRegisters/ЗаданияНаЗакупкиСтатусы/ЗаданияНаЗакупкиСтатусы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияНаЗакупкиСтатусы</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаданийНаЗакупку</types>
    </type>
  </resources>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КабельнаяЛиния</name>
    <type>
      <types>CatalogRef.КабельныеЛинии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_кабельной_продукции/src/Enums/СтатусыЗаданийНаЗакупку/СтатусыЗаданийНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаданийНаЗакупку</name>
  <enumValues>
    <name>ВыданоПодрядчику</name>
  </enumValues>
  <enumValues>
    <name>НаДоработке</name>
  </enumValues>
  <enumValues>
    <name>Принято</name>
  </enumValues>
  <enumValues>
    <name>Аннулировано</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/Enums/СтатусыКабельныхЛиний/СтатусыКабельныхЛиний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКабельныхЛиний</name>
  <enumValues>
    <name>ЗаданиеНаЗакупкуНеВыдано</name>
  </enumValues>
  <enumValues>
    <name>ЗаданиеНаЗакупкуКППВОформлении</name>
  </enumValues>
  <enumValues>
    <name>ВЗакупке</name>
  </enumValues>
  <enumValues>
    <name>ВходнойКонтрольНеПройден</name>
  </enumValues>
  <enumValues>
    <name>ЭМРКППНеРазрешён</name>
  </enumValues>
  <enumValues>
    <name>ЗаданиеНаЭМРКППВОформлении</name>
  </enumValues>
  <enumValues>
    <name>ЭМРКПП</name>
  </enumValues>
  <enumValues>
    <name>ПредъявлениеЭМРКПП</name>
  </enumValues>
  <enumValues>
    <name>ЗамечанияКЭМРКПП</name>
  </enumValues>
  <enumValues>
    <name>ПодписаниеИКЖЧистовик</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>Аннулировано</name>
  </enumValues>
  <enumValues>
    <name>Заменён</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/Documents/ЗаданияНаЗакупку/ObjectModule.bsl
#Область ОбработчикиСобытийОбъекта
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;	
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", Ссылка.Пустая());
	
	Если Не ЭтоАннулирование() И Не ДополнительныеСвойства.ЭтоНовый 
		И УправлениеДоступом.ЕстьРоль("Подрядчик", Ссылка, Пользователи.АвторизованныйПользователь()) Тогда		
		СтатусДокумента = ПолучитьСтатус();    		
	КонецЕсли;
	
	Если СтатусДокумента = Перечисления.СтатусыЗаданийНаЗакупку.Принято Тогда   
		ЗаписатьКабельныеЛинииВПринятые();
	Иначе
		УдалитьКабельныеЛинииИзПринятых();
	КонецЕсли;			
	
КонецПроцедуры 

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда   
		СписокСвязанныхДокументов = КонтрольУдаленияДокументовСервер.ПолучитьСвязанныеДокументыЗаданияНаЗакупки(Ссылка);		
		КонтрольУдаленияДокументовСервер.ПроверитьЕстьСвязанныеДокументыПередПометкойУдаления(Ссылка, СписокСвязанныхДокументов, Отказ);		
	КонецЕсли;	
	
	Если Не ЭтоАннулирование() И Не ДополнительныеСвойства.ЭтоНовый Тогда
		ПроверитьВозможностьЗаписиСНеПринятымиПозициями(Отказ);		
	КонецЕсли;

	УдалитьСтатусыДокументаИзУчета();	
		
	Если Не ПометкаУдаления Тогда
		ЗафиксироватьСтатусДокумента();  
	КонецЕсли;

	СтатусКабельнойЛинии = СтатусыСервер.ПолучитьСтатусКабельнойЛинии(СтатусДокумента, ПометкаУдаления);     
	Если ЗначениеЗаполнено(СтатусКабельнойЛинии) Тогда
		ПроведениеСервер.ЗаписьДанныеВРСДанныеЖКП(КабельныеЛинии,,СтатусКабельнойЛинии, Истина);   
	КонецЕсли;	
	
КонецПроцедуры
#КонецОбласти

#Область ПрочиеПроцедурыИФункции 
Функция ПолучитьСтатус()
	
	СтрокаНеПринято = КабельныеЛинии.Найти(Ложь, "Принято");
	
	Если Не СтрокаНеПринято = Неопределено Тогда
		Возврат Перечисления.СтатусыЗаданийНаЗакупку.НаДоработке;
	Иначе
		Возврат Перечисления.СтатусыЗаданийНаЗакупку.Принято;	
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьВозможностьЗаписиСНеПринятымиПозициями(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданияНаЗакупкуКабельныеЛинии.НомерСтроки КАК НомерСтроки,
	               |	ЗаданияНаЗакупкуКабельныеЛинии.Комментарий КАК Комментарий
	               |ИЗ
	               |	Документ.ЗаданияНаЗакупку.КабельныеЛинии КАК ЗаданияНаЗакупкуКабельныеЛинии
	               |ГДЕ
	               |	ЗаданияНаЗакупкуКабельныеЛинии.Ссылка = &Ссылка
	               |	И НЕ ЗаданияНаЗакупкуКабельныеЛинии.Принято
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		Если СокрЛП(Выборка.Комментарий) = "" Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Необходимо комментировать отмену позиции %1", Выборка.НомерСтроки),,,, Отказ);	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоАннулирование()

	Возврат СтатусДокумента = Перечисления.СтатусыЗаданийНаЗакупку.Аннулировано;
	
КонецФункции

Процедура ЗаписатьКабельныеЛинииВПринятые()   

	УдалитьУдаленныеКабельныеИзТЧ();
	
	УстановитьПривилегированныйРежим(Истина);		
	Для Каждого ТекСтрокаКабельныхЛиний Из КабельныеЛинии Цикл
		МенеджерЗаписи = РегистрыСведений.ЗаданияНаЗакупкиПринятыеКабельныеЛинии.СоздатьМенеджерЗаписи();   
		МенеджерЗаписи.КабельняЛиния = ТекСтрокаКабельныхЛиний.КабельнаяЛиния;
		МенеджерЗаписи.Записать();
	КонецЦикла;	
	
КонецПроцедуры	

Процедура УдалитьКабельныеЛинииИзПринятых()   
	
	УдалитьУдаленныеКабельныеИзТЧ();
	
	УстановитьПривилегированныйРежим(Истина);	
	Для Каждого ТекСтрокаКабельныхЛиний Из КабельныеЛинии Цикл
		МенеджерЗаписи = РегистрыСведений.ЗаданияНаЗакупкиПринятыеКабельныеЛинии.СоздатьМенеджерЗаписи();   
		МенеджерЗаписи.КабельняЛиния = ТекСтрокаКабельныхЛиний.КабельнаяЛиния;
		МенеджерЗаписи.Удалить();
	КонецЦикла;	
	
КонецПроцедуры	

Процедура УдалитьУдаленныеКабельныеИзТЧ()

	УстановитьПривилегированныйРежим(Истина);	
	СписокУдаляемыхКЛ = ОбщегоНазначенияПереопределяемый.СписокУдаляемыхСтрокКабельныеЛинии(Ссылка, КабельныеЛинии);
	Для Каждого УдаляемыйКабель Из СписокУдаляемыхКЛ Цикл   
		МенеджерЗаписи = РегистрыСведений.ЗаданияНаЗакупкиПринятыеКабельныеЛинии.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.КабельняЛиния = УдаляемыйКабель;
		МенеджерЗаписи.Удалить();				
	КонецЦикла;

КонецПроцедуры	

Процедура ЗафиксироватьСтатусДокумента() 
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписи = РегистрыСведений.ЗаданияНаЗакупкиСтатусы.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.Регистратор.Установить(Ссылка);  
	Для Каждого ТекСтр Из КабельныеЛинии Цикл
		Запись                = НаборЗаписи.Добавить(); 
		Запись.КабельнаяЛиния = ТекСтр.КабельнаяЛиния; 
		Запись.Статус         = СтатусДокумента;
		Запись.Номер          = Номер;
		Запись.Дата           = Дата; 
	КонецЦикла;
	НаборЗаписи.Записать();
	
КонецПроцедуры	

Процедура УдалитьСтатусыДокументаИзУчета()    
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписи = РегистрыСведений.ЗаданияНаЗакупкиСтатусы.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.Регистратор.Установить(Ссылка);     
	НаборЗаписи.Записать();
	
КонецПроцедуры	

Функция ОпределитьСтатусКабельнойЛинии()    
	
	СтатусКабельнойЛинии = Неопределено;
	Если ПометкаУдаления Тогда   
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЗаданиеНаЗакупкуНеВыдано;
	ИначеЕсли СтатусДокумента = Перечисления.СтатусыЗаданийНаЗакупку.ВыданоПодрядчику Тогда   
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЗаданиеНаЗакупкуКППВОформлении;	     
	ИначеЕсли СтатусДокумента = Перечисления.СтатусыЗаданийНаЗакупку.Принято Тогда   
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ВЗакупке;	     	
	КонецЕсли;	
	
	Возврат СтатусКабельнойЛинии;
	
КонецФункции	
#КонецОбласти
